[Killed] BlockStatement
lib/components/player/subtitle-mapper.ts:10:27
 function mapWordDifficulty(
   token: TokenWithLearningState,
   classification?: Subtitle["classification"],
-): WordData["difficulty"] {
-  if (token.isKnown) {
-    return "easy";
-  }
-
-  if (classification === "LEARNING") {
-    return "learning";
-  }
-
-  if (classification === "HARD") {
-    return "hard";
-  }
-
-  return "easy";
-}
+): WordData["difficulty"] {}
 
 function buildWordBreakdown(token: TokenWithLearningState): string | undefined {
killedBy: mapSegmentsToPlayerSubtitles WhenLearningState_ThenMapsDifficultyAndBreakdown
statusReason: expected undefined to be 'learning' // Object.is equality

[Killed] BlockStatement
lib/components/player/subtitle-mapper.ts:11:22
   token: TokenWithLearningState,
   classification?: Subtitle["classification"],
 ): WordData["difficulty"] {
-  if (token.isKnown) {
-    return "easy";
-  }
+  if (token.isKnown) {}
 
   if (classification === "LEARNING") {
killedBy: mapSegmentsToPlayerSubtitles WhenLearningState_ThenMapsDifficultyAndBreakdown
statusReason: expected 'learning' to be 'easy' // Object.is equality

[Killed] ConditionalExpression
lib/components/player/subtitle-mapper.ts:11:7
   token: TokenWithLearningState,
   classification?: Subtitle["classification"],
 ): WordData["difficulty"] {
-  if (token.isKnown) {
+  if (false) {
     return "easy";
   }
killedBy: mapSegmentsToPlayerSubtitles WhenLearningState_ThenMapsDifficultyAndBreakdown
statusReason: expected 'learning' to be 'easy' // Object.is equality

[Killed] StringLiteral
lib/components/player/subtitle-mapper.ts:12:12
   classification?: Subtitle["classification"],
 ): WordData["difficulty"] {
   if (token.isKnown) {
-    return "easy";
+    return "";
   }
 
killedBy: mapSegmentsToPlayerSubtitles WhenLearningState_ThenMapsDifficultyAndBreakdown
statusReason: expected '' to be 'easy' // Object.is equality

[Killed] ConditionalExpression
lib/components/player/subtitle-mapper.ts:15:7
     return "easy";
   }
 
-  if (classification === "LEARNING") {
+  if (true) {
     return "learning";
   }
killedBy: mapSegmentsToPlayerSubtitles WhenHardClassification_ThenDifficultyHard
statusReason: expected 'learning' to be 'hard' // Object.is equality

[Killed] EqualityOperator
lib/components/player/subtitle-mapper.ts:15:7
     return "easy";
   }
 
-  if (classification === "LEARNING") {
+  if (classification !== "LEARNING") {
     return "learning";
   }
killedBy: mapSegmentsToPlayerSubtitles WhenLearningState_ThenMapsDifficultyAndBreakdown
statusReason: expected 'easy' to be 'learning' // Object.is equality

[Killed] EqualityOperator
lib/components/player/subtitle-mapper.ts:19:7
     return "learning";
   }
 
-  if (classification === "HARD") {
+  if (classification !== "HARD") {
     return "hard";
   }
killedBy: mapSegmentsToPlayerSubtitles WhenHardClassification_ThenDifficultyHard
statusReason: expected 'easy' to be 'hard' // Object.is equality

[Killed] BlockStatement
lib/components/player/subtitle-mapper.ts:19:34
     return "learning";
   }
 
-  if (classification === "HARD") {
-    return "hard";
-  }
+  if (classification === "HARD") {}
 
   return "easy";
killedBy: mapSegmentsToPlayerSubtitles WhenHardClassification_ThenDifficultyHard
statusReason: expected 'easy' to be 'hard' // Object.is equality

[Killed] BlockStatement
lib/components/player/subtitle-mapper.ts:26:80
   return "easy";
 }
 
-function buildWordBreakdown(token: TokenWithLearningState): string | undefined {
-  const details = [token.pos];
-  if (token.isKnown !== undefined) {
-    details.push(token.isKnown ? "Known" : "Unknown");
-  }
-
-  return details.join(" • ");
-}
+function buildWordBreakdown(token: TokenWithLearningState): string | undefined {}
 
 function buildFallbackTranslation(segment: SegmentWithTranslation): string {
killedBy: mapSegmentsToPlayerSubtitles WhenLearningState_ThenMapsDifficultyAndBreakdown
statusReason: expected undefined to be 'INTJ • Unknown' // Object.is equality

[Killed] ArrayDeclaration
lib/components/player/subtitle-mapper.ts:27:19
 }
 
 function buildWordBreakdown(token: TokenWithLearningState): string | undefined {
-  const details = [token.pos];
+  const details = [];
   if (token.isKnown !== undefined) {
     details.push(token.isKnown ? "Known" : "Unknown");
killedBy: mapSegmentsToPlayerSubtitles WhenLearningState_ThenMapsDifficultyAndBreakdown
statusReason: expected 'Unknown' to be 'INTJ • Unknown' // Object.is equality

[Killed] ConditionalExpression
lib/components/player/subtitle-mapper.ts:28:7
 
 function buildWordBreakdown(token: TokenWithLearningState): string | undefined {
   const details = [token.pos];
-  if (token.isKnown !== undefined) {
+  if (false) {
     details.push(token.isKnown ? "Known" : "Unknown");
   }
killedBy: mapSegmentsToPlayerSubtitles WhenLearningState_ThenMapsDifficultyAndBreakdown
statusReason: expected 'INTJ' to be 'INTJ • Unknown' // Object.is equality

[Killed] ConditionalExpression
lib/components/player/subtitle-mapper.ts:28:7
 
 function buildWordBreakdown(token: TokenWithLearningState): string | undefined {
   const details = [token.pos];
-  if (token.isKnown !== undefined) {
+  if (true) {
     details.push(token.isKnown ? "Known" : "Unknown");
   }
killedBy: mapSegmentsToPlayerSubtitles WhenMissingIsKnown_ThenBreakdownOmitsStatus
statusReason: expected 'VERB • Unknown' to be 'VERB' // Object.is equality

[Killed] StringLiteral
lib/components/player/subtitle-mapper.ts:29:34
 function buildWordBreakdown(token: TokenWithLearningState): string | undefined {
   const details = [token.pos];
   if (token.isKnown !== undefined) {
-    details.push(token.isKnown ? "Known" : "Unknown");
+    details.push(token.isKnown ? "" : "Unknown");
   }
 
killedBy: mapSegmentsToPlayerSubtitles WhenLearningState_ThenMapsDifficultyAndBreakdown
statusReason: expected 'NOUN • ' to be 'NOUN • Known' // Object.is equality

[Killed] BlockStatement
lib/components/player/subtitle-mapper.ts:35:76
   return details.join(" • ");
 }
 
-function buildFallbackTranslation(segment: SegmentWithTranslation): string {
-  return segment.tokens
-    .map(
-      (token) => (token.translation || token.text) + (token.whitespace || ""),
-    )
-    .join("")
-    .trim();
-}
+function buildFallbackTranslation(segment: SegmentWithTranslation): string {}
 
 export function mapSegmentsToPlayerSubtitles(
killedBy: mapSegmentsToPlayerSubtitles WhenMissingTranslation_ThenFallsBackToTokenTexts
statusReason: expected undefined to be 'Hello mundo' // Object.is equality

[Survived] MethodExpression
lib/components/player/subtitle-mapper.ts:36:10
 }
 
 function buildFallbackTranslation(segment: SegmentWithTranslation): string {
-  return segment.tokens
-    .map(
-      (token) => (token.translation || token.text) + (token.whitespace || ""),
-    )
-    .join("")
-    .trim();
+  return segment.tokens.map(token => (token.translation || token.text) + (token.whitespace || "")).join("");
 }
 

[Killed] ConditionalExpression
lib/components/player/subtitle-mapper.ts:38:55
 function buildFallbackTranslation(segment: SegmentWithTranslation): string {
   return segment.tokens
     .map(
-      (token) => (token.translation || token.text) + (token.whitespace || ""),
+      (token) => (token.translation || token.text) + (false),
     )
     .join("")
killedBy: mapSegmentsToPlayerSubtitles WhenMissingTranslation_ThenFallsBackToTokenTexts
statusReason: expected 'Hellofalsemundofalse' to be 'Hello mundo' // Object.is equality

[Killed] ConditionalExpression
lib/components/player/subtitle-mapper.ts:38:55
 function buildFallbackTranslation(segment: SegmentWithTranslation): string {
   return segment.tokens
     .map(
-      (token) => (token.translation || token.text) + (token.whitespace || ""),
+      (token) => (token.translation || token.text) + (true),
     )
     .join("")
killedBy: mapSegmentsToPlayerSubtitles WhenMissingTranslation_ThenFallsBackToTokenTexts
statusReason: expected 'Hellotruemundotrue' to be 'Hello mundo' // Object.is equality

[Killed] StringLiteral
lib/components/player/subtitle-mapper.ts:40:11
     .map(
       (token) => (token.translation || token.text) + (token.whitespace || ""),
     )
-    .join("")
+    .join("Stryker was here!")
     .trim();
 }
killedBy: mapSegmentsToPlayerSubtitles WhenMissingTranslation_ThenFallsBackToTokenTexts
statusReason: expected 'Hello Stryker was here!mundo' to be 'Hello mundo' // Object.is equality

[Killed] BlockStatement
lib/components/player/subtitle-mapper.ts:47:18
 export function mapSegmentsToPlayerSubtitles(
   segments: SegmentWithTranslation[] | null | undefined,
 ): Subtitle[] {
-  if (!segments) {
-    return [];
-  }
+  if (!segments) {}
 
   return segments.map((segment) => ({
killedBy: mapSegmentsToPlayerSubtitles WhenNullInput_ThenReturnsEmptyArray
statusReason: Cannot read properties of null (reading 'map')

[Killed] ConditionalExpression
lib/components/player/subtitle-mapper.ts:47:7
 export function mapSegmentsToPlayerSubtitles(
   segments: SegmentWithTranslation[] | null | undefined,
 ): Subtitle[] {
-  if (!segments) {
+  if (true) {
     return [];
   }
killedBy: mapSegmentsToPlayerSubtitles WhenLearningState_ThenMapsDifficultyAndBreakdown
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrowFunction
lib/components/player/subtitle-mapper.ts:51:23
     return [];
   }
 
-  return segments.map((segment) => ({
-    start: segment.start,
-    end: segment.end,
-    text: segment.text,
-    translation: segment.translation || buildFallbackTranslation(segment),
-    classification: segment.classification as Subtitle["classification"],
-    words: segment.tokens.map((token) => ({
-      text: token.text,
-      difficulty: mapWordDifficulty(
-        token as TokenWithLearningState,
-        segment.classification as Subtitle["classification"],
-      ),
-      lemma: token.lemma,
-      translation: token.translation,
-      breakdown: buildWordBreakdown(token as TokenWithLearningState),
-      whitespace: token.whitespace,
-      isKnown: (token as TokenWithLearningState).isKnown,
-      partOfSpeech: token.pos,
-    })),
-  }));
+  return segments.map(() => undefined);
 }
 
killedBy: mapSegmentsToPlayerSubtitles WhenLearningState_ThenMapsDifficultyAndBreakdown
statusReason: Cannot read properties of undefined (reading 'translation')

[Killed] ObjectLiteral
lib/components/player/subtitle-mapper.ts:51:37
     return [];
   }
 
-  return segments.map((segment) => ({
-    start: segment.start,
-    end: segment.end,
-    text: segment.text,
-    translation: segment.translation || buildFallbackTranslation(segment),
-    classification: segment.classification as Subtitle["classification"],
-    words: segment.tokens.map((token) => ({
-      text: token.text,
-      difficulty: mapWordDifficulty(
-        token as TokenWithLearningState,
-        segment.classification as Subtitle["classification"],
-      ),
-      lemma: token.lemma,
-      translation: token.translation,
-      breakdown: buildWordBreakdown(token as TokenWithLearningState),
-      whitespace: token.whitespace,
-      isKnown: (token as TokenWithLearningState).isKnown,
-      partOfSpeech: token.pos,
-    })),
-  }));
+  return segments.map((segment) => ({}));
 }
 
killedBy: mapSegmentsToPlayerSubtitles WhenLearningState_ThenMapsDifficultyAndBreakdown
statusReason: expected undefined to be 'Hello world' // Object.is equality

[Killed] LogicalOperator
lib/components/player/subtitle-mapper.ts:55:18
     start: segment.start,
     end: segment.end,
     text: segment.text,
-    translation: segment.translation || buildFallbackTranslation(segment),
+    translation: segment.translation && buildFallbackTranslation(segment),
     classification: segment.classification as Subtitle["classification"],
     words: segment.tokens.map((token) => ({
killedBy: mapSegmentsToPlayerSubtitles WhenMissingTranslation_ThenFallsBackToTokenTexts
statusReason: expected undefined to be 'Hello mundo' // Object.is equality

[Killed] ConditionalExpression
lib/components/player/subtitle-mapper.ts:55:18
     start: segment.start,
     end: segment.end,
     text: segment.text,
-    translation: segment.translation || buildFallbackTranslation(segment),
+    translation: false,
     classification: segment.classification as Subtitle["classification"],
     words: segment.tokens.map((token) => ({
killedBy: mapSegmentsToPlayerSubtitles WhenLearningState_ThenMapsDifficultyAndBreakdown
statusReason: expected false to be 'Hello world' // Object.is equality

[Killed] ArrowFunction
lib/components/player/subtitle-mapper.ts:57:31
     text: segment.text,
     translation: segment.translation || buildFallbackTranslation(segment),
     classification: segment.classification as Subtitle["classification"],
-    words: segment.tokens.map((token) => ({
-      text: token.text,
-      difficulty: mapWordDifficulty(
-        token as TokenWithLearningState,
-        segment.classification as Subtitle["classification"],
-      ),
-      lemma: token.lemma,
-      translation: token.translation,
-      breakdown: buildWordBreakdown(token as TokenWithLearningState),
-      whitespace: token.whitespace,
-      isKnown: (token as TokenWithLearningState).isKnown,
-      partOfSpeech: token.pos,
-    })),
+    words: segment.tokens.map(() => undefined),
   }));
 }
killedBy: mapSegmentsToPlayerSubtitles WhenLearningState_ThenMapsDifficultyAndBreakdown
statusReason: Cannot read properties of undefined (reading 'difficulty')
