[Killed] ArrayDeclaration
lib/components/player/video-player-utils.ts:12:40
 const MEDIA_ERR_DECODE = 3;
 const MEDIA_ERR_SRC_NOT_SUPPORTED = 4;
 
-const SUBTITLE_MODES: SubtitleMode[] = [
-  "OFF",
-  "FILTERED",
-  "DUAL",
-  "ORIGINAL",
-];
+const SUBTITLE_MODES: SubtitleMode[] = [];
 
 const ERROR_MESSAGES: Record<number, string> = {
killedBy: getNextSubtitleMode WhenOff_ThenReturnsFiltered
statusReason: expected undefined to be 'FILTERED' // Object.is equality

[Killed] StringLiteral
lib/components/player/video-player-utils.ts:13:3
 const MEDIA_ERR_SRC_NOT_SUPPORTED = 4;
 
 const SUBTITLE_MODES: SubtitleMode[] = [
-  "OFF",
+  "",
   "FILTERED",
   "DUAL",
killedBy: getNextSubtitleMode WhenOff_ThenReturnsFiltered
statusReason: expected '' to be 'FILTERED' // Object.is equality

[Killed] ObjectLiteral
lib/components/player/video-player-utils.ts:19:48
   "ORIGINAL",
 ];
 
-const ERROR_MESSAGES: Record<number, string> = {
-  [MEDIA_ERR_ABORTED]: "Playback aborted by user.",
-  [MEDIA_ERR_NETWORK]: "Network error while downloading.",
-  [MEDIA_ERR_DECODE]:
-    "Video playback aborted due to a corruption problem or because the video used features your browser did not support.",
-  [MEDIA_ERR_SRC_NOT_SUPPORTED]:
-    "The video could not be loaded, either because the server or network failed or because the format is not supported (File might be missing).",
-};
+const ERROR_MESSAGES: Record<number, string> = {};
 
 const DEFAULT_ERROR_MESSAGE = "Unknown error occurred";
killedBy: getMediaErrorMessage WhenAbortedCode_ThenReturnsAbortedMessage
statusReason: expected 'Unknown error occurred' to be 'Playback aborted by user.' // Object.is equality

[Killed] StringLiteral
lib/components/player/video-player-utils.ts:20:24
 ];
 
 const ERROR_MESSAGES: Record<number, string> = {
-  [MEDIA_ERR_ABORTED]: "Playback aborted by user.",
+  [MEDIA_ERR_ABORTED]: "",
   [MEDIA_ERR_NETWORK]: "Network error while downloading.",
   [MEDIA_ERR_DECODE]:
killedBy: getMediaErrorMessage WhenAbortedCode_ThenReturnsAbortedMessage
statusReason: expected '' to be 'Playback aborted by user.' // Object.is equality

[Killed] StringLiteral
lib/components/player/video-player-utils.ts:30:35
 
 const DEFAULT_ERROR_MESSAGE = "Unknown error occurred";
 
-const AUDIO_EXTENSIONS = [".m4a", ".mp3"];
+const AUDIO_EXTENSIONS = [".m4a", ""];
 
 const PROGRESS_REPORT_INTERVAL_SECONDS = 5;
killedBy: isAudioFile WhenMp4_ThenReturnsFalse
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
lib/components/player/video-player-utils.ts:41:53
  * Formats a duration in seconds to a human-readable time string.
  * Returns H:MM:SS for durations >= 1 hour, otherwise M:SS.
  */
-export function formatTime(seconds: number): string {
-  if (!Number.isFinite(seconds) || seconds < 0) {
-    return "0:00";
-  }
-
-  const totalSeconds = Math.floor(seconds);
-  const hours = Math.floor(totalSeconds / SECONDS_IN_HOUR);
-  const mins = Math.floor((totalSeconds % SECONDS_IN_HOUR) / SECONDS_IN_MINUTE);
-  const secs = totalSeconds % SECONDS_IN_MINUTE;
-
-  if (hours > 0) {
-    return `${hours}:${mins.toString().padStart(PAD_LENGTH, "0")}:${secs.toString().padStart(PAD_LENGTH, "0")}`;
-  }
-
-  return `${mins}:${secs.toString().padStart(PAD_LENGTH, "0")}`;
-}
+export function formatTime(seconds: number): string {}
 
 /**
killedBy: formatTime WhenZero_ThenReturnsZeroWithZeroSeconds
statusReason: expected undefined to be '0:00' // Object.is equality

[Killed] LogicalOperator
lib/components/player/video-player-utils.ts:42:7
  * Returns H:MM:SS for durations >= 1 hour, otherwise M:SS.
  */
 export function formatTime(seconds: number): string {
-  if (!Number.isFinite(seconds) || seconds < 0) {
+  if (!Number.isFinite(seconds) && seconds < 0) {
     return "0:00";
   }
killedBy: formatTime WhenNaN_ThenReturnsZeroColonZeroZero
statusReason: expected 'NaN:NaN' to be '0:00' // Object.is equality

[Killed] BooleanLiteral
lib/components/player/video-player-utils.ts:42:7
  * Returns H:MM:SS for durations >= 1 hour, otherwise M:SS.
  */
 export function formatTime(seconds: number): string {
-  if (!Number.isFinite(seconds) || seconds < 0) {
+  if (Number.isFinite(seconds) || seconds < 0) {
     return "0:00";
   }
killedBy: formatTime When65Seconds_ThenReturnsOneColonZeroFive
statusReason: expected '0:00' to be '1:05' // Object.is equality

[Killed] ArithmeticOperator
lib/components/player/video-player-utils.ts:47:28
   }
 
   const totalSeconds = Math.floor(seconds);
-  const hours = Math.floor(totalSeconds / SECONDS_IN_HOUR);
+  const hours = Math.floor(totalSeconds * SECONDS_IN_HOUR);
   const mins = Math.floor((totalSeconds % SECONDS_IN_HOUR) / SECONDS_IN_MINUTE);
   const secs = totalSeconds % SECONDS_IN_MINUTE;
killedBy: formatTime When65Seconds_ThenReturnsOneColonZeroFive
statusReason: expected '234000:01:05' to be '1:05' // Object.is equality

[Killed] ArithmeticOperator
lib/components/player/video-player-utils.ts:48:27
 
   const totalSeconds = Math.floor(seconds);
   const hours = Math.floor(totalSeconds / SECONDS_IN_HOUR);
-  const mins = Math.floor((totalSeconds % SECONDS_IN_HOUR) / SECONDS_IN_MINUTE);
+  const mins = Math.floor(totalSeconds % SECONDS_IN_HOUR * SECONDS_IN_MINUTE);
   const secs = totalSeconds % SECONDS_IN_MINUTE;
 
killedBy: formatTime When65Seconds_ThenReturnsOneColonZeroFive
statusReason: expected '3900:05' to be '1:05' // Object.is equality

[Killed] ArithmeticOperator
lib/components/player/video-player-utils.ts:48:28
 
   const totalSeconds = Math.floor(seconds);
   const hours = Math.floor(totalSeconds / SECONDS_IN_HOUR);
-  const mins = Math.floor((totalSeconds % SECONDS_IN_HOUR) / SECONDS_IN_MINUTE);
+  const mins = Math.floor((totalSeconds * SECONDS_IN_HOUR) / SECONDS_IN_MINUTE);
   const secs = totalSeconds % SECONDS_IN_MINUTE;
 
killedBy: formatTime When65Seconds_ThenReturnsOneColonZeroFive
statusReason: expected '3900:05' to be '1:05' // Object.is equality

[Killed] ArithmeticOperator
lib/components/player/video-player-utils.ts:49:16
   const totalSeconds = Math.floor(seconds);
   const hours = Math.floor(totalSeconds / SECONDS_IN_HOUR);
   const mins = Math.floor((totalSeconds % SECONDS_IN_HOUR) / SECONDS_IN_MINUTE);
-  const secs = totalSeconds % SECONDS_IN_MINUTE;
+  const secs = totalSeconds * SECONDS_IN_MINUTE;
 
   if (hours > 0) {
killedBy: formatTime When65Seconds_ThenReturnsOneColonZeroFive
statusReason: expected '1:3900' to be '1:05' // Object.is equality

[Killed] BlockStatement
lib/components/player/video-player-utils.ts:51:18
   const mins = Math.floor((totalSeconds % SECONDS_IN_HOUR) / SECONDS_IN_MINUTE);
   const secs = totalSeconds % SECONDS_IN_MINUTE;
 
-  if (hours > 0) {
-    return `${hours}:${mins.toString().padStart(PAD_LENGTH, "0")}:${secs.toString().padStart(PAD_LENGTH, "0")}`;
-  }
+  if (hours > 0) {}
 
   return `${mins}:${secs.toString().padStart(PAD_LENGTH, "0")}`;
killedBy: formatTime When3661Seconds_ThenReturnsHourFormat
statusReason: expected '1:01' to be '1:01:01' // Object.is equality

[Killed] ConditionalExpression
lib/components/player/video-player-utils.ts:51:7
   const mins = Math.floor((totalSeconds % SECONDS_IN_HOUR) / SECONDS_IN_MINUTE);
   const secs = totalSeconds % SECONDS_IN_MINUTE;
 
-  if (hours > 0) {
+  if (false) {
     return `${hours}:${mins.toString().padStart(PAD_LENGTH, "0")}:${secs.toString().padStart(PAD_LENGTH, "0")}`;
   }
killedBy: formatTime When3661Seconds_ThenReturnsHourFormat
statusReason: expected '1:01' to be '1:01:01' // Object.is equality

[Killed] StringLiteral
lib/components/player/video-player-utils.ts:52:61
   const secs = totalSeconds % SECONDS_IN_MINUTE;
 
   if (hours > 0) {
-    return `${hours}:${mins.toString().padStart(PAD_LENGTH, "0")}:${secs.toString().padStart(PAD_LENGTH, "0")}`;
+    return `${hours}:${mins.toString().padStart(PAD_LENGTH, "")}:${secs.toString().padStart(PAD_LENGTH, "0")}`;
   }
 
killedBy: formatTime When3661Seconds_ThenReturnsHourFormat
statusReason: expected '1:1:01' to be '1:01:01' // Object.is equality

[Killed] BlockStatement
lib/components/player/video-player-utils.ts:62:60
  * Maps a MediaError code to a user-friendly message.
  * Returns a default message for unknown codes.
  */
-export function getMediaErrorMessage(code: number): string {
-  return ERROR_MESSAGES[code] ?? DEFAULT_ERROR_MESSAGE;
-}
+export function getMediaErrorMessage(code: number): string {}
 
 /**
killedBy: getMediaErrorMessage WhenAbortedCode_ThenReturnsAbortedMessage
statusReason: expected undefined to be 'Playback aborted by user.' // Object.is equality

[Killed] LogicalOperator
lib/components/player/video-player-utils.ts:63:10
  * Returns a default message for unknown codes.
  */
 export function getMediaErrorMessage(code: number): string {
-  return ERROR_MESSAGES[code] ?? DEFAULT_ERROR_MESSAGE;
+  return ERROR_MESSAGES[code] && DEFAULT_ERROR_MESSAGE;
 }
 
killedBy: getMediaErrorMessage WhenAbortedCode_ThenReturnsAbortedMessage
statusReason: expected 'Unknown error occurred' to be 'Playback aborted by user.' // Object.is equality

[Killed] BlockStatement
lib/components/player/video-player-utils.ts:69:74
 /**
  * Returns the next subtitle mode in the cycle: OFF -> FILTERED -> DUAL -> ORIGINAL -> OFF.
  */
-export function getNextSubtitleMode(current: SubtitleMode): SubtitleMode {
-  const idx = SUBTITLE_MODES.indexOf(current);
-  return SUBTITLE_MODES[(idx + 1) % SUBTITLE_MODES.length];
-}
+export function getNextSubtitleMode(current: SubtitleMode): SubtitleMode {}
 
 /**
killedBy: getNextSubtitleMode WhenOff_ThenReturnsFiltered
statusReason: expected undefined to be 'FILTERED' // Object.is equality

[Killed] ArithmeticOperator
lib/components/player/video-player-utils.ts:71:25
  */
 export function getNextSubtitleMode(current: SubtitleMode): SubtitleMode {
   const idx = SUBTITLE_MODES.indexOf(current);
-  return SUBTITLE_MODES[(idx + 1) % SUBTITLE_MODES.length];
+  return SUBTITLE_MODES[(idx + 1) * SUBTITLE_MODES.length];
 }
 
killedBy: getNextSubtitleMode WhenOff_ThenReturnsFiltered
statusReason: expected undefined to be 'FILTERED' // Object.is equality

[Killed] ArithmeticOperator
lib/components/player/video-player-utils.ts:71:26
  */
 export function getNextSubtitleMode(current: SubtitleMode): SubtitleMode {
   const idx = SUBTITLE_MODES.indexOf(current);
-  return SUBTITLE_MODES[(idx + 1) % SUBTITLE_MODES.length];
+  return SUBTITLE_MODES[(idx - 1) % SUBTITLE_MODES.length];
 }
 
killedBy: getNextSubtitleMode WhenOff_ThenReturnsFiltered
statusReason: expected undefined to be 'FILTERED' // Object.is equality

[Killed] BlockStatement
lib/components/player/video-player-utils.ts:77:56
 /**
  * Returns true if the file path is an audio-only file (mp3/m4a).
  */
-export function isAudioFile(filePath: string): boolean {
-  const lower = filePath?.toLowerCase() ?? "";
-  return AUDIO_EXTENSIONS.some((ext) => lower.endsWith(ext));
-}
+export function isAudioFile(filePath: string): boolean {}
 
 /**
killedBy: isAudioFile WhenMp3_ThenReturnsTrue
statusReason: expected undefined to be true // Object.is equality

[Killed] OptionalChaining
lib/components/player/video-player-utils.ts:78:17
  * Returns true if the file path is an audio-only file (mp3/m4a).
  */
 export function isAudioFile(filePath: string): boolean {
-  const lower = filePath?.toLowerCase() ?? "";
+  const lower = filePath.toLowerCase() ?? "";
   return AUDIO_EXTENSIONS.some((ext) => lower.endsWith(ext));
 }
killedBy: isAudioFile WhenUndefined_ThenReturnsFalse
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] LogicalOperator
lib/components/player/video-player-utils.ts:78:17
  * Returns true if the file path is an audio-only file (mp3/m4a).
  */
 export function isAudioFile(filePath: string): boolean {
-  const lower = filePath?.toLowerCase() ?? "";
+  const lower = filePath?.toLowerCase() && "";
   return AUDIO_EXTENSIONS.some((ext) => lower.endsWith(ext));
 }
killedBy: isAudioFile WhenMp3_ThenReturnsTrue
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
lib/components/player/video-player-utils.ts:79:10
  */
 export function isAudioFile(filePath: string): boolean {
   const lower = filePath?.toLowerCase() ?? "";
-  return AUDIO_EXTENSIONS.some((ext) => lower.endsWith(ext));
+  return AUDIO_EXTENSIONS.every(ext => lower.endsWith(ext));
 }
 
killedBy: isAudioFile WhenMp3_ThenReturnsTrue
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
lib/components/player/video-player-utils.ts:79:32
  */
 export function isAudioFile(filePath: string): boolean {
   const lower = filePath?.toLowerCase() ?? "";
-  return AUDIO_EXTENSIONS.some((ext) => lower.endsWith(ext));
+  return AUDIO_EXTENSIONS.some(() => undefined);
 }
 
killedBy: isAudioFile WhenMp3_ThenReturnsTrue
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
lib/components/player/video-player-utils.ts:86:93
  * Calculates the next game interrupt time based on interval and chunk index.
  * Returns Infinity if intervalSeconds is 0 or negative.
  */
-export function calculateNextInterrupt(intervalSeconds: number, chunkIndex: number): number {
-  if (intervalSeconds <= 0) return Infinity;
-  return intervalSeconds * (chunkIndex + 1);
-}
+export function calculateNextInterrupt(intervalSeconds: number, chunkIndex: number): number {}
 
 /**
killedBy: calculateNextInterrupt WhenPositiveInterval_ThenMultipliesByChunkPlusOne
statusReason: expected undefined to be 60 // Object.is equality

[Killed] EqualityOperator
lib/components/player/video-player-utils.ts:87:7
  * Returns Infinity if intervalSeconds is 0 or negative.
  */
 export function calculateNextInterrupt(intervalSeconds: number, chunkIndex: number): number {
-  if (intervalSeconds <= 0) return Infinity;
+  if (intervalSeconds < 0) return Infinity;
   return intervalSeconds * (chunkIndex + 1);
 }
killedBy: calculateNextInterrupt WhenZeroInterval_ThenReturnsInfinity
statusReason: expected +0 to be Infinity // Object.is equality

[Killed] EqualityOperator
lib/components/player/video-player-utils.ts:87:7
  * Returns Infinity if intervalSeconds is 0 or negative.
  */
 export function calculateNextInterrupt(intervalSeconds: number, chunkIndex: number): number {
-  if (intervalSeconds <= 0) return Infinity;
+  if (intervalSeconds > 0) return Infinity;
   return intervalSeconds * (chunkIndex + 1);
 }
killedBy: calculateNextInterrupt WhenPositiveInterval_ThenMultipliesByChunkPlusOne
statusReason: expected Infinity to be 60 // Object.is equality

[Killed] ArithmeticOperator
lib/components/player/video-player-utils.ts:88:29
  */
 export function calculateNextInterrupt(intervalSeconds: number, chunkIndex: number): number {
   if (intervalSeconds <= 0) return Infinity;
-  return intervalSeconds * (chunkIndex + 1);
+  return intervalSeconds * (chunkIndex - 1);
 }
 
killedBy: calculateNextInterrupt WhenPositiveInterval_ThenMultipliesByChunkPlusOne
statusReason: expected -60 to be 60 // Object.is equality

[Killed] ArithmeticOperator
lib/components/player/video-player-utils.ts:88:10
  */
 export function calculateNextInterrupt(intervalSeconds: number, chunkIndex: number): number {
   if (intervalSeconds <= 0) return Infinity;
-  return intervalSeconds * (chunkIndex + 1);
+  return intervalSeconds / (chunkIndex + 1);
 }
 
killedBy: calculateNextInterrupt WhenPositiveInterval_ThenMultipliesByChunkPlusOne
statusReason: expected 20 to be 180 // Object.is equality

[Killed] BlockStatement
lib/components/player/video-player-utils.ts:97:11
 export function getTranscriptItemClass(
   currentTime: number,
   subtitle: Subtitle,
-): string {
-  const isCurrent = currentTime >= subtitle.start && currentTime <= subtitle.end;
-
-  if (isCurrent) {
-    return "border-amber-400/70 bg-white/10";
-  }
-
-  if (subtitle.classification === "LEARNING") {
-    return "border-amber-500/30";
-  }
-
-  if (subtitle.classification === "HARD") {
-    return "border-red-500/30";
-  }
-
-  return "border-white/10";
-}
+): string {}
 
 /**
killedBy: getTranscriptItemClass WhenCurrentTimeInRange_ThenReturnsActiveClass
statusReason: expected undefined to be 'border-amber-400/70 bg-white/10' // Object.is equality

[Killed] EqualityOperator
lib/components/player/video-player-utils.ts:98:54
   currentTime: number,
   subtitle: Subtitle,
 ): string {
-  const isCurrent = currentTime >= subtitle.start && currentTime <= subtitle.end;
+  const isCurrent = currentTime >= subtitle.start && currentTime > subtitle.end;
 
   if (isCurrent) {
killedBy: getTranscriptItemClass WhenCurrentTimeInRange_ThenReturnsActiveClass
statusReason: expected 'border-white/10' to be 'border-amber-400/70 bg-white/10' // Object.is equality

[Killed] ConditionalExpression
lib/components/player/video-player-utils.ts:98:21
   currentTime: number,
   subtitle: Subtitle,
 ): string {
-  const isCurrent = currentTime >= subtitle.start && currentTime <= subtitle.end;
+  const isCurrent = true;
 
   if (isCurrent) {
killedBy: getTranscriptItemClass WhenLearningClassification_ThenReturnsLearningClass
statusReason: expected 'border-amber-400/70 bg-white/10' to be 'border-amber-500/30' // Object.is equality

[Killed] BlockStatement
lib/components/player/video-player-utils.ts:100:18
 ): string {
   const isCurrent = currentTime >= subtitle.start && currentTime <= subtitle.end;
 
-  if (isCurrent) {
-    return "border-amber-400/70 bg-white/10";
-  }
+  if (isCurrent) {}
 
   if (subtitle.classification === "LEARNING") {
killedBy: getTranscriptItemClass WhenCurrentTimeInRange_ThenReturnsActiveClass
statusReason: expected 'border-white/10' to be 'border-amber-400/70 bg-white/10' // Object.is equality

[Killed] ConditionalExpression
lib/components/player/video-player-utils.ts:100:7
 ): string {
   const isCurrent = currentTime >= subtitle.start && currentTime <= subtitle.end;
 
-  if (isCurrent) {
+  if (false) {
     return "border-amber-400/70 bg-white/10";
   }
killedBy: getTranscriptItemClass WhenCurrentTimeInRange_ThenReturnsActiveClass
statusReason: expected 'border-white/10' to be 'border-amber-400/70 bg-white/10' // Object.is equality

[Killed] StringLiteral
lib/components/player/video-player-utils.ts:101:12
   const isCurrent = currentTime >= subtitle.start && currentTime <= subtitle.end;
 
   if (isCurrent) {
-    return "border-amber-400/70 bg-white/10";
+    return "";
   }
 
killedBy: getTranscriptItemClass WhenCurrentTimeInRange_ThenReturnsActiveClass
statusReason: expected '' to be 'border-amber-400/70 bg-white/10' // Object.is equality

[Killed] ConditionalExpression
lib/components/player/video-player-utils.ts:104:7
     return "border-amber-400/70 bg-white/10";
   }
 
-  if (subtitle.classification === "LEARNING") {
+  if (false) {
     return "border-amber-500/30";
   }
killedBy: getTranscriptItemClass WhenLearningClassification_ThenReturnsLearningClass
statusReason: expected 'border-white/10' to be 'border-amber-500/30' // Object.is equality

[Killed] BlockStatement
lib/components/player/video-player-utils.ts:104:47
     return "border-amber-400/70 bg-white/10";
   }
 
-  if (subtitle.classification === "LEARNING") {
-    return "border-amber-500/30";
-  }
+  if (subtitle.classification === "LEARNING") {}
 
   if (subtitle.classification === "HARD") {
killedBy: getTranscriptItemClass WhenLearningClassification_ThenReturnsLearningClass
statusReason: expected 'border-white/10' to be 'border-amber-500/30' // Object.is equality

[Killed] EqualityOperator
lib/components/player/video-player-utils.ts:108:7
     return "border-amber-500/30";
   }
 
-  if (subtitle.classification === "HARD") {
+  if (subtitle.classification !== "HARD") {
     return "border-red-500/30";
   }
killedBy: getTranscriptItemClass WhenHardClassification_ThenReturnsHardClass
statusReason: expected 'border-white/10' to be 'border-red-500/30' // Object.is equality

[Killed] ConditionalExpression
lib/components/player/video-player-utils.ts:108:7
     return "border-amber-500/30";
   }
 
-  if (subtitle.classification === "HARD") {
+  if (false) {
     return "border-red-500/30";
   }
killedBy: getTranscriptItemClass WhenHardClassification_ThenReturnsHardClass
statusReason: expected 'border-white/10' to be 'border-red-500/30' // Object.is equality

[Killed] BlockStatement
lib/components/player/video-player-utils.ts:121:15
 export function markWordKnown(
   subtitles: Subtitle[],
   lemma: string,
-): Subtitle[] {
-  return subtitles.map((subtitle) => ({
-    ...subtitle,
-    words: subtitle.words?.map((word) =>
-      word.lemma === lemma
-        ? { ...word, isKnown: true, difficulty: "easy" as const }
-        : word,
-    ),
-  }));
-}
+): Subtitle[] {}
 
 /**
killedBy: markWordKnown WhenLemmaMatches_ThenMarksKnown
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArrowFunction
lib/components/player/video-player-utils.ts:122:24
   subtitles: Subtitle[],
   lemma: string,
 ): Subtitle[] {
-  return subtitles.map((subtitle) => ({
-    ...subtitle,
-    words: subtitle.words?.map((word) =>
-      word.lemma === lemma
-        ? { ...word, isKnown: true, difficulty: "easy" as const }
-        : word,
-    ),
-  }));
+  return subtitles.map(() => undefined);
 }
 
killedBy: markWordKnown WhenLemmaMatches_ThenMarksKnown
statusReason: Cannot read properties of undefined (reading 'words')

[Killed] ObjectLiteral
lib/components/player/video-player-utils.ts:122:39
   subtitles: Subtitle[],
   lemma: string,
 ): Subtitle[] {
-  return subtitles.map((subtitle) => ({
-    ...subtitle,
-    words: subtitle.words?.map((word) =>
-      word.lemma === lemma
-        ? { ...word, isKnown: true, difficulty: "easy" as const }
-        : word,
-    ),
-  }));
+  return subtitles.map((subtitle) => ({}));
 }
 
killedBy: markWordKnown WhenLemmaMatches_ThenMarksKnown
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArrowFunction
lib/components/player/video-player-utils.ts:124:32
 ): Subtitle[] {
   return subtitles.map((subtitle) => ({
     ...subtitle,
-    words: subtitle.words?.map((word) =>
-      word.lemma === lemma
-        ? { ...word, isKnown: true, difficulty: "easy" as const }
-        : word,
+    words: subtitle.words?.map(() => undefined,
     ),
   }));
killedBy: markWordKnown WhenLemmaMatches_ThenMarksKnown
statusReason: Cannot read properties of undefined (reading 'isKnown')

[Survived] OptionalChaining
lib/components/player/video-player-utils.ts:124:12
 ): Subtitle[] {
   return subtitles.map((subtitle) => ({
     ...subtitle,
-    words: subtitle.words?.map((word) =>
+    words: subtitle.words.map((word) =>
       word.lemma === lemma
         ? { ...word, isKnown: true, difficulty: "easy" as const }

[Killed] EqualityOperator
lib/components/player/video-player-utils.ts:125:7
   return subtitles.map((subtitle) => ({
     ...subtitle,
     words: subtitle.words?.map((word) =>
-      word.lemma === lemma
+      word.lemma !== lemma
         ? { ...word, isKnown: true, difficulty: "easy" as const }
         : word,
killedBy: markWordKnown WhenLemmaMatches_ThenMarksKnown
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
lib/components/player/video-player-utils.ts:125:7
   return subtitles.map((subtitle) => ({
     ...subtitle,
     words: subtitle.words?.map((word) =>
-      word.lemma === lemma
+      true
         ? { ...word, isKnown: true, difficulty: "easy" as const }
         : word,
killedBy: markWordKnown WhenLemmaMatches_ThenMarksKnown
statusReason: expected true to be undefined

[Killed] BooleanLiteral
lib/components/player/video-player-utils.ts:126:31
     ...subtitle,
     words: subtitle.words?.map((word) =>
       word.lemma === lemma
-        ? { ...word, isKnown: true, difficulty: "easy" as const }
+        ? { ...word, isKnown: false, difficulty: "easy" as const }
         : word,
     ),
killedBy: markWordKnown WhenLemmaMatches_ThenMarksKnown
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
lib/components/player/video-player-utils.ts:139:12
   currentTime: number,
   duration: number,
   lastReportedSecond: number,
-): boolean {
-  const roundedCurrentTime = Math.round(currentTime);
-  const roundedDuration = Math.round(duration);
-  if (roundedDuration <= 0) return false;
-  return (
-    Math.abs(roundedCurrentTime - lastReportedSecond) >=
-    PROGRESS_REPORT_INTERVAL_SECONDS
-  );
-}
+): boolean {}
 
 /**
killedBy: shouldReportProgress WhenFiveSecondsElapsed_ThenReturnsTrue
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
lib/components/player/video-player-utils.ts:142:36
 ): boolean {
   const roundedCurrentTime = Math.round(currentTime);
   const roundedDuration = Math.round(duration);
-  if (roundedDuration <= 0) return false;
+  if (roundedDuration <= 0) return true;
   return (
     Math.abs(roundedCurrentTime - lastReportedSecond) >=
killedBy: shouldReportProgress WhenDurationZero_ThenReturnsFalse
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
lib/components/player/video-player-utils.ts:142:7
 ): boolean {
   const roundedCurrentTime = Math.round(currentTime);
   const roundedDuration = Math.round(duration);
-  if (roundedDuration <= 0) return false;
+  if (roundedDuration > 0) return false;
   return (
     Math.abs(roundedCurrentTime - lastReportedSecond) >=
killedBy: shouldReportProgress WhenFiveSecondsElapsed_ThenReturnsTrue
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
lib/components/player/video-player-utils.ts:144:5
   const roundedDuration = Math.round(duration);
   if (roundedDuration <= 0) return false;
   return (
-    Math.abs(roundedCurrentTime - lastReportedSecond) >=
-    PROGRESS_REPORT_INTERVAL_SECONDS
+    Math.abs(roundedCurrentTime - lastReportedSecond) > PROGRESS_REPORT_INTERVAL_SECONDS
   );
 }
killedBy: shouldReportProgress WhenFiveSecondsElapsed_ThenReturnsTrue
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/components/player/video-player-utils.ts:144:5
   const roundedDuration = Math.round(duration);
   if (roundedDuration <= 0) return false;
   return (
-    Math.abs(roundedCurrentTime - lastReportedSecond) >=
-    PROGRESS_REPORT_INTERVAL_SECONDS
+    false
   );
 }
killedBy: shouldReportProgress WhenFiveSecondsElapsed_ThenReturnsTrue
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
lib/components/player/video-player-utils.ts:152:84
 /**
  * Calculates the progress percentage from current time and duration.
  */
-export function calcProgressPercent(currentTime: number, duration: number): number {
-  const roundedCurrent = Math.round(currentTime);
-  const roundedDuration = Math.round(duration);
-  if (roundedDuration <= 0) return 0;
-  return (roundedCurrent / roundedDuration) * PERCENTAGE_BASE;
-}
+export function calcProgressPercent(currentTime: number, duration: number): number {}
 
killedBy: calcProgressPercent WhenHalfway_ThenReturns50
statusReason: expected undefined to be 50 // Object.is equality

[Killed] ConditionalExpression
lib/components/player/video-player-utils.ts:155:7
 export function calcProgressPercent(currentTime: number, duration: number): number {
   const roundedCurrent = Math.round(currentTime);
   const roundedDuration = Math.round(duration);
-  if (roundedDuration <= 0) return 0;
+  if (true) return 0;
   return (roundedCurrent / roundedDuration) * PERCENTAGE_BASE;
 }
killedBy: calcProgressPercent WhenHalfway_ThenReturns50
statusReason: expected +0 to be 50 // Object.is equality

[Killed] ConditionalExpression
lib/components/player/video-player-utils.ts:155:7
 export function calcProgressPercent(currentTime: number, duration: number): number {
   const roundedCurrent = Math.round(currentTime);
   const roundedDuration = Math.round(duration);
-  if (roundedDuration <= 0) return 0;
+  if (false) return 0;
   return (roundedCurrent / roundedDuration) * PERCENTAGE_BASE;
 }
killedBy: calcProgressPercent WhenDurationZero_ThenReturnsZero
statusReason: expected Infinity to be +0 // Object.is equality

[Killed] ArithmeticOperator
lib/components/player/video-player-utils.ts:156:10
   const roundedCurrent = Math.round(currentTime);
   const roundedDuration = Math.round(duration);
   if (roundedDuration <= 0) return 0;
-  return (roundedCurrent / roundedDuration) * PERCENTAGE_BASE;
+  return roundedCurrent / roundedDuration / PERCENTAGE_BASE;
 }
 
killedBy: calcProgressPercent WhenHalfway_ThenReturns50
statusReason: expected 0.005 to be 50 // Object.is equality

[Killed] ArithmeticOperator
lib/components/player/video-player-utils.ts:156:11
   const roundedCurrent = Math.round(currentTime);
   const roundedDuration = Math.round(duration);
   if (roundedDuration <= 0) return 0;
-  return (roundedCurrent / roundedDuration) * PERCENTAGE_BASE;
+  return (roundedCurrent * roundedDuration) * PERCENTAGE_BASE;
 }
 
killedBy: calcProgressPercent WhenHalfway_ThenReturns50
statusReason: expected 500000 to be 50 // Object.is equality
