[Killed] BlockStatement
src/lib/utils/game-window.ts:9:15
 export function getUpcomingGameWindow(
   nextInterruptTime: number,
   intervalSeconds: number,
-): GameWindow {
-  return {
-    start: nextInterruptTime,
-    end: nextInterruptTime + intervalSeconds,
-  };
-}
+): GameWindow {}
 
killedBy: getUpcomingGameWindow returns the next unseen interval after an interruption point
statusReason: expected undefined to deeply equal { start: 600, end: 1200 }

[Killed] ArithmeticOperator
src/lib/utils/game-window.ts:12:10
 ): GameWindow {
   return {
     start: nextInterruptTime,
-    end: nextInterruptTime + intervalSeconds,
+    end: nextInterruptTime - intervalSeconds,
   };
 }
killedBy: getUpcomingGameWindow returns the next unseen interval after an interruption point
statusReason: expected { start: 600, end: +0 } to deeply equal { start: 600, end: 1200 }
